InformationRegisters/Инфотек_СоответствиеОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Инфотек_СоответствиеОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.Инфотек_ВидыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Инфотек_ВидыОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъектаУточнения</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.Инфотек_ВидыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектУточнения</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.Инфотек_ВидыОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инфотек_НастройкиПодключения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Автомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Автомобили</Name>
			<Comment>Дополнительные характеристики автомобилей</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение дополнительного свойства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:EnumRef.ВидАвтомобиля</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КтоВнес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КогдаВнес</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗначения</Name>
					<Comment>Вид значения дополнительного свойства автомобиля</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДополнительнаяИнформацияАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактныеЛицаКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактныеЛицаКонтрагентов</Name>
			<Comment>Контактные лица контрагентов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использование</Name>
					<Comment>Использование</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Comment>Основной</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОтношений</Name>
					<Comment>Вид отношений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаимоотношений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ведущий</Name>
					<Comment>Ведущий контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ведомый</Name>
					<Comment>Ведомый контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДокументов</Name>
			<Comment>Виды подтверждающих документов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сертификат</Name>
					<Comment>Сертификат</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидНаЖительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свидетельство</Name>
					<Comment>Свидетельство</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпискаИзЭлектронногоПаспорта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лицензия</Name>
					<Comment>Лицензия</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паспорт</Name>
					<Comment>Общегражданский паспорт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удостоверение</Name>
					<Comment>Удостоверение личности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доверенность</Name>
					<Comment>Доверенность</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоенныйБилет</Name>
					<Comment>Военный билет</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справка</Name>
					<Comment>Справка (например об освобождении)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий документ удостоверяющий личность</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПТС</Name>
					<Comment>Паспорт транспортного средства</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АттестатТО</Name>
					<Comment>Аттестат аккредитации оператора технического осмотра транспортных средств</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/Инфотек_ИнтеграцияCRMПереопределяемый/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общие процедуры и функции сбора данных

// Функция получения синонима из перечисления  
//                           
// Параметры:
//  Значение - Строка - Значение перечисления.
//
// Возвращаемое значение:
//  Синоним перечисления 
//  
Функция ИмяЗначенияПеречисления(Значение) Экспорт
      
      ОбъектМетаданных = Значение.Метаданные();
      
      ИндексЗначения = Перечисления[ОбъектМетаданных.Имя].Индекс(Значение);
      
      Возврат ОбъектМетаданных.ЗначенияПеречисления[ИндексЗначения].Синоним;
      
КонецФункции

// Функция получения бренда (марки) автомобиля, который был сопоставлен с CRM или DNM системой  
//                           
// Параметры:
//  Модель - СправочникСсылка.Модели - Модель автомобиля, для которой необходимо получить бренд.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Бренд - Значение марки или каталога справочника модели (зависит от настроек, сделанных пользователем при задании параметров подключения
//  и сопоставлении справочной информации).  
//  
Функция ПолучитьБренд(Модель,НастройкаПодключения) Экспорт
	
	Бренд = Неопределено;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Инфотек_СоответствиеОбъектов.Объект
	|ИЗ
	|	РегистрСведений.Инфотек_СоответствиеОбъектов КАК Инфотек_СоответствиеОбъектов
	|ГДЕ
	|	Инфотек_СоответствиеОбъектов.ВидОбъекта = &ВидОбъекта
	|	И Инфотек_СоответствиеОбъектов.НастройкаПодключения = &НастройкаПодключения";
	Запрос.УстановитьПараметр("ВидОбъекта",ПланыВидовХарактеристик.Инфотек_ВидыОбъектов.Бренд);	
	Запрос.УстановитьПараметр("НастройкаПодключения",НастройкаПодключения);	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() цикл
		Если ЗначениеЗаполнено(Модель) И Модель.ПолучитьОбъект() <> Неопределено Тогда 
			Если Модель.ПринадлежитЭлементу(Результат.Объект) Тогда
				Бренд = Результат.Объект;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Бренд;
	
КонецФункции

// Функция получения контактной информации объекта  
//                           
// Параметры:
//  ОбъектКлиент - СправочникСсылка - Объект для получения контактной информации.
//  ТипКИ        - ПеречисленияСсылка.ТипыКонтактнойИнформации - тип контактной информации.
//  ВидКИ        - СправочникСсылка.ВидыКонтактнойИнформации - вид контактной информации.
//
// Возвращаемое значение:
//  Результат - Строка представления контактной информации  
//  
Функция ПолучитьКИ(ОбъектКлиент,ТипКИ,ВидКИ="") Экспорт
	
	Запрос = новый Запрос();
	Запрос.УстановитьПараметр("парКлиент",ОбъектКлиент);
	Запрос.УстановитьПараметр("парТипКИ",ТипКИ);
	Запрос.УстановитьПараметр("парВидКИ",ВидКИ);	
	Запрос.Текст = "Выбрать *
	|из РегистрСведений.КонтактнаяИнформация как КИ
	|Где Объект = &парКлиент
	|  и Тип    = &парТипКИ
	|  "+?(ЗначениеЗаполнено(ВидКИ),"и Вид = &парВидКИ","")+"
	|";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат;
	
КонецФункции

// Функция получения паспортных данных контрагента  
//                           
// Параметры:
//  ОбъектКлиент - СправочникСсылка.Контрагенты - Объект для получения паспортных данных.
//
// Возвращаемое значение:
//  Выборка - Паспортные данные контрагента  
//  
Функция ПолучитьПаспортныеДанные(ОбъектКлиент) Экспорт
	
	Запрос = новый Запрос();
	Запрос.УстановитьПараметр("парКлиент",ОбъектКлиент);
	Запрос.Текст = "Выбрать *
	|Из справочник.ПодтверждающиеДокументы
	|Где Владелец=&парКлиент
	|  и не ПометкаУдаления
	|  и ВидПодтверждающегоДокумента = Значение(Перечисление.ВидыДокументов.Паспорт)";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Функция получениядополнительных характеристик автомобиля  
//                           
// Параметры:
//  ОбъектАвто  - СправочникСсылка.Автомобиль - Объект для получения характеристик.
//  ВидЗначения - ПеречислениеСсылка.ДополнительнаяИнформацияАвтомобилей - Вид необходимой характеристики.
//
// Возвращаемое значение:
//  Выборка - значения характеристик автомобиля  
//  
Функция ПолучитьИнфоПоАвто(ОбъектАвто,ВидЗначения,Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос();
	Если ЗначениеЗаполнено(Дата) Тогда	
		Запрос.УстановитьПараметр("парДата",Дата);
	Иначе
		Запрос.УстановитьПараметр("парДата",ТекущаяДата());
	КонецЕсли;
	Запрос.УстановитьПараметр("парВидЗначения",ВидЗначения);
	Запрос.УстановитьПараметр("парАвто",ОбъектАвто);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АвтомобилиСрезПоследних.Период,
	|	АвтомобилиСрезПоследних.Автомобиль,
	|	АвтомобилиСрезПоследних.ВидЗначения,
	|	АвтомобилиСрезПоследних.Значение
	|ИЗ
	|	РегистрСведений.Автомобили.СрезПоследних(
	|			&парДата,
	|			ВидЗначения = &парВидЗначения
	|				И Автомобиль = &парАвто) КАК АвтомобилиСрезПоследних";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Функция получения контактных лиц контрагента  
//                           
// Параметры:
//  ОбъектКлиент - СправочникСсылка.Контрагенты - Объект для получения контактных лиц.
//
// Возвращаемое значение:
//  Выборка - Контактные лица контрагента  
//  
Функция ПолучитьКЛ(ОбъектКлиент) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("парКлиент",ОбъектКлиент);		
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	КЛ.Ведомый КАК КонтактноеЛицо,
	|	КЛ.Ведомый.Наименование КАК Наименование,
	|	КИ.Представление КАК ТелефонКЛ
	|ИЗ
	|	РегистрСведений.КонтактныеЛицаКонтрагентов КАК КЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КИ
	|		ПО (КИ.Объект = КЛ.Ведомый)
	|			И (КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|ГДЕ
	|	КЛ.Ведущий = &парКлиент";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Функция убирает лишние символы из строки, оставляет только цифры 
//                           
// Параметры:
//  СтрокаТелефон - Строка - для преобразования данных.
//
// Возвращаемое значение:
//  ТелефонЧислами - Преобразованная строка.  
//  
Функция ПолучитьТелефонЦифрами(СтрокаТелефон) Экспорт
	
	ТелефонЧислами = "";
	
	ДлинаТелефона = СтрДлина(СтрокаТелефон);
	Для НомерСимвола = 1 По ДлинаТелефона Цикл
		ТекСимвол = Сред(СтрокаТелефон,НомерСимвола,1);
		Если Найти("0123456789",ТекСимвол) > 0 Тогда
			ТелефонЧислами = ТелефонЧислами + ТекСимвол;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТелефонЧислами;
	
КонецФункции

// Функция поиска контрагента в 1С по номеру телефона 
//                           
// Параметры:
//  НомерТелефона - Строка - для поиска.
//
// Возвращаемое значение:
//  Контрагент - Ссылка на элемент справочника контрагенты.  
//  
Функция НайтиПоНомеруТелефона(НомерТелефона) Экспорт
	
	ТелефонДляПоиска = НомерТелефона;
	ТелефонДляПоиска = ПолучитьТелефонЦифрами(ТелефонДляПоиска);
	Если Лев(ТелефонДляПоиска,1) = "7" или Лев(ТелефонДляПоиска,1)="8" Тогда
		ТелефонДляПоиска = Сред(ТелефонДляПоиска,2);
	КонецЕсли;
	Контрагент    = Справочники.Контрагенты.ПустаяСсылка();	
	
	Запрос = новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КИ.Объект КАК Объект,
	|	КИ.Представление КАК Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КИ
	|ГДЕ
	|	КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КИ.Объект ССЫЛКА Справочник.Контрагенты
	|	И ВЫБОР
	|			КОГДА КИ.Поле1 <> """"
	|					И КИ.Поле2 <> """"
	|					И КИ.Поле3 <> """"
	|				ТОГДА """" + КИ.Поле1 + КИ.Поле2 + КИ.Поле3 ПОДОБНО &Телефон
	|			ИНАЧЕ КИ.Представление ПОДОБНО &Телефон
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("Телефон", "%" + ТелефонДляПоиска + "%");

	Результат = запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Контрагент = Результат.Объект;
		прервать;
	КонецЦикла;
	
	Возврат Контрагент;		
	
КонецФункции

// Функция поиска контрагента в 1С по номеру телефона И ФИО 
//                           
// Параметры:
//  НомерТелефона - Строка - для поиска. 
//  Наименование - Строка - для поиска по ФИО.
//
// Возвращаемое значение:
//  Контрагент - Ссылка на элемент справочника контрагенты.  
//  
Функция НайтиПоНомеруТелефонаФИО(НомерТелефона,Наименование) Экспорт
	
	ТелефонДляПоиска = НомерТелефона;
	ТелефонДляПоиска = ПолучитьТелефонЦифрами(ТелефонДляПоиска);
	Если Лев(ТелефонДляПоиска,1) = "7" или Лев(ТелефонДляПоиска,1)="8" Тогда
		ТелефонДляПоиска = Сред(ТелефонДляПоиска,2);
	КонецЕсли;
	Контрагент    = Справочники.Контрагенты.ПустаяСсылка();	
	
	Запрос = новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КИ.Объект КАК Объект,
	|	КИ.Представление КАК Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КИ
	|ГДЕ
	|	КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|	И КИ.Объект ССЫЛКА Справочник.Контрагенты
	|	И ВЫБОР
	|			КОГДА КИ.Поле1 <> """"
	|					И КИ.Поле2 <> """"
	|					И КИ.Поле3 <> """"
	|				ТОГДА """" + КИ.Поле1 + КИ.Поле2 + КИ.Поле3 ПОДОБНО &Телефон
	|			ИНАЧЕ КИ.Представление ПОДОБНО &Телефон
	|		КОНЕЦ
	|	И КИ.Объект.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Телефон", "%" + ТелефонДляПоиска + "%");
	Запрос.УстановитьПараметр("Наименование", Наименование);

	Результат = запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Контрагент = Результат.Объект;
		прервать;
	КонецЦикла;
	
	Возврат Контрагент;		
	
КонецФункции

// Функция поиска контрагента в 1С по ФИО и дате рождения 
//                           
// Параметры:
//  ФИО          - Строка - для поиска по наименованию.
//  ДатаРождения - Строка - для поиска по дате рождения.
//
// Возвращаемое значение:
//  Контрагент - Ссылка на элемент справочника контрагенты.  
//  
Функция НайтиПоФИОДатеРождения(ФИО, ДатаРождения) Экспорт
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	ДатаРождения = Инфотек_ОбщиеПроцедуры.ПреобразоватьСтрокуВДату(ДатаРождения);
	Если обЗначениеНеЗаполнено(ДатаРождения) Тогда
		Возврат Контрагент;
	КонецЕсли;
	
	Запрос = новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Наименование = &Наименование
	|	И Контрагенты.ДатаРождения = &ДатаРождения";
	Запрос.УстановитьПараметр("ДатаРождения", ДатаРождения);
	Запрос.УстановитьПараметр("Наименование", СокрЛП(ФИО));
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Контрагент = Результат.Ссылка;
		Прервать;
	КонецЦикла;
	
	Возврат Контрагент;	
КонецФункции

// Функция получения кода перечисления 
//                           
// Параметры:
//  Значение     - Строка - Значение перечисления.
//  Перечисление - Строка - Наименование перечисления.
//
// Возвращаемое значение:
//  Код элемента перечисления.  
// 
Функция ПолучитьКодПеречисления(Значение, Перечисление)
	
	// так как у перечисления нет кода. то придумаем его сами
	ЕСли Перечисление = "СостояниеЗаказНаряда" Тогда
		Если Значение = Перечисления[Перечисление].Закрыт Тогда
			ВозВрат 1;
		иначеЕсли Значение = Перечисления[Перечисление].Заявка Тогда
			ВозВрат 2;
		иначеЕсли Значение = Перечисления[Перечисление].ВРаботе Тогда
			ВозВрат 3;
		иначеЕсли Значение = Перечисления[Перечисление].Согласование Тогда
			ВозВрат 4;
		иначеЕсли Значение = Перечисления[Перечисление].Выполнен Тогда
			ВозВрат 5;
		иначеЕсли Значение = Перечисления[Перечисление].Стоянка Тогда
			ВозВрат 6;
		иначеЕсли Значение = Перечисления[Перечисление].Ожидание Тогда
			ВозВрат 7;
		Иначе 
			ВозВрат 0;
		КонецЕсли;	
	Иначе 
		ВозВрат 0;
	КонецЕсли;
	
КонецФункции

// Функция поиска автомобиля по реквизитам из структуры обращения CRM 
//                           
// Параметры:
//  СтруктураАвто - Структура - Структура реквизитов автомобиля из CRM.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключенияDNM - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  Автомобиль.  
// 
Функция НайтиАвтомобильПоСтруктуре(СтруктураАвто,НастройкаПодключения) Экспорт
	
	VIN = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.vin);
	ГосНомер = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.reg_number);    
	ИдМодели = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.model_id);   
	СтруктураМодель = СтруктураАвто.model;
    Автомобиль = Неопределено;   
	
	Если ЗначениеЗаполнено(VIN) ИЛИ ЗначениеЗаполнено(ГосНомер) Тогда
		ЗапросАвто = новый Запрос();
		ЗапросАвто.УстановитьПараметр("парДатаЗаписи",ТекущаяДата());
		ЗапросАвто.Текст = 
		"ВЫБРАТЬ
		|	Авто.Ссылка КАК Ссылка,
		|	Авто.VIN КАК VIN,
		|	РС.Значение КАК ГосНомер
		|ИЗ
		|	Справочник.Автомобили КАК Авто
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(&парДатаЗаписи, ВидЗначения = ЗНАЧЕНИЕ(Перечисление.ДополнительнаяИнформацияАвтомобилей.ГосНомер)) КАК РС
		|		ПО (РС.Автомобиль = Авто.Ссылка)
		|ГДЕ
		|	НЕ Авто.ПометкаУдаления
		|	И НЕ Авто.ЭтоГруппа
		|	И Авто.VIN ПОДОБНО ""%"" + &VIN + ""%""
		|	И РС.Значение ПОДОБНО ""%"" + &ГосНомер + ""%""";
		ЗапросАвто.УстановитьПараметр("VIN","%" + VIN + "%");
		ЗапросАвто.УстановитьПараметр("ГосНомер","%" + ГосНомер + "%");
		РезАвто = ЗапросАвто.Выполнить().Выбрать();
		Пока РезАвто.Следующий() Цикл
			Автомобиль = РезАвто.Ссылка;
			Прервать;
		КонецЦикла;		
	КонецЕсли;   
	
	Если Автомобиль = Неопределено Тогда
    	Автомобиль = Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураАвто.brand.name) + " " + Инфотек_ОбщиеПроцедуры.УбратьКавычки(СтруктураМодель.name) + " " + VIN + " " + ГосНомер;
    КонецЕсли; 

	Возврат Автомобиль;
	
КонецФункции

// Функция, получения ссылки на корень дерева документов
//
// Параметр:
//	ДокументКорень         - ДокументСсылка - Переданный документ
//	ТаблицаКонтроляПовтора - Переданный массив документов
//	ОписаниеТиповДок       -  Описание типов документов.
//
// Возвращаемое значение:
//	ДокументСсылка - Корень документа.
//
Функция НайтиПервыйДокументЦепочкиПодчиненности(ДокументКорень,ТаблицаКонтроляПовтора,ОписаниеТиповДокументов) Экспорт
	
	ЗначениеРеквизита = Неопределено;
	ВидДокумента = ДокументКорень.Метаданные().Имя;
	
	// Обход реквизитов в поисках подходящего корня
	Для Каждого Реквизит Из Метаданные.Документы[ВидДокумента].Реквизиты Цикл
		ЗначениеРеквизита = ДокументКорень[Реквизит.Имя];
		
		Если ПроверкаПодчиненияРеквизиту(ДокументКорень,ЗначениеРеквизита,ТаблицаКонтроляПовтора,ОписаниеТиповДокументов) Тогда
			ТаблицаКонтроляПовтора.Добавить(ЗначениеРеквизита);
			Возврат НайтиПервыйДокументЦепочкиПодчиненности(ЗначениеРеквизита,ТаблицаКонтроляПовтора,ОписаниеТиповДокументов);
		КонецЕсли;
		
	КонецЦикла;
	
	// Если в реквизитах ничего не было найдено, обходим реквизиты табличных частей
	// Перебираем все ТЧ.
	Для Каждого ТЧ Из Метаданные.Документы[ВидДокумента].ТабличныеЧасти Цикл
		
		// Перебираем все строки ТЧ
		Для ИндексСтроки = 0 По ДокументКорень[ТЧ.Имя].Количество()-1 Цикл
			
			// Перебираем все реквизиты строки
			Для Каждого РеквизитТЧ Из ТЧ.Реквизиты Цикл
				
				ИмяРеквизитТЧ = Метаданные.Документы[ВидДокумента].ТабличныеЧасти[ТЧ.Имя].Реквизиты[РеквизитТЧ.Имя];
				ЗначениеРеквизита = ДокументКорень[ТЧ.Имя][ИндексСтроки][ИмяРеквизитТЧ.Имя];
				
				Если ПроверкаПодчиненияРеквизиту(ДокументКорень,ЗначениеРеквизита,ТаблицаКонтроляПовтора,ОписаниеТиповДокументов) Тогда
					ТаблицаКонтроляПовтора.Добавить(ЗначениеРеквизита);
					Возврат НайтиПервыйДокументЦепочкиПодчиненности(ЗначениеРеквизита,ТаблицаКонтроляПовтора,ОписаниеТиповДокументов);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ДокументКорень;
	
КонецФункции

// Функция проверяет, может ли документ являться подчиненным реквизиту
//
// Параметр:
//	ДокументСсылка         - ДокументСсылка - Переданный документ
//	ЗнРеквизит             - Реквизит       - Переданный реквизит
//	ТаблицаКонтроляПовтора - Переданный массив документов.
//
// Возвращаемое значение:
//	Булево         - Результат проверки.
//
Функция ПроверкаПодчиненияРеквизиту(ДокументСсылка,Основание,ТаблицаКонтроляПовтора,ОписаниеТиповДокументов)
	
	Если (Основание <> Неопределено) И (ОписаниеТиповДокументов.СодержитТип(ТипЗнч(Основание))) Тогда
		
		Если (Основание<>Документы[Основание.Метаданные().Имя].ПустаяСсылка()) И (Основание<>ДокументСсылка) Тогда
			
			// проверка на дубль
			Если НЕ (ТаблицаКонтроляПовтора.Найти(Основание) = Неопределено) Тогда
				Возврат Ложь;
			КонецЕсли;
			
			// Проверка, что текущий документ может быть подчиненным для предполагаемого корня.
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПодчиненныеДокументы.Ссылка КАК Документ
			|ИЗ
			|	КритерийОтбора.ПодчиненныеДокументы(&Основание) КАК ПодчиненныеДокументы
			|ГДЕ
			|	ПодчиненныеДокументы.Ссылка = &ДокументСсылка";
			Запрос.УстановитьПараметр("Основание",Основание);
			Запрос.УстановитьПараметр("ДокументСсылка",ДокументСсылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Количество() > 0 Тогда
				Возврат Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ПолучитьКореньДокумента()

// Функция получения рабочих листов по документу отдела продаж  
//                           
// Параметры:
//  Документ - ДокументСсылка - Ссылка на документ в иерархии которого необходимо найти рабочий лист.
//
// Возвращаемое значение:
//  МассивРабочихЛистов - массив документов рабочий лист.  
//  
Функция ПолучитьРабочиеЛистыПоДокументу(Документ) Экспорт
	
	МассивРабочихЛистов = Новый Массив;
	
	ТаблицаКонтроляПовтора = Новый Массив;
	
	ОписаниеТиповДокументов = Документы.ТипВсеСсылки();
	ТаблицаКонтроляПовтора.Добавить(Документ);		
	// Найти корень дерева
	ДокументКорень = НайтиПервыйДокументЦепочкиПодчиненности(Документ, ТаблицаКонтроляПовтора, ОписаниеТиповДокументов);		
	
	ТаблицаСвязанныхДокументов = Новый ТаблицаЗначений;
	ТаблицаСвязанныхДокументов.Колонки.Добавить("Ссылка");
	НоваяСтрока = ТаблицаСвязанныхДокументов.Добавить();
	НоваяСтрока.Ссылка = ДокументКорень;
	
	Для Каждого СтрокаТаблицы Из ТаблицаСвязанныхДокументов Цикл
		МассивСвязанныхДокументов = КритерииОтбора.ПодчиненныеДокументы.Найти(СтрокаТаблицы.Ссылка);			
		Для Каждого ЭлементКоллекции Из МассивСвязанныхДокументов Цикл
			РезультатПоиска = ТаблицаСвязанныхДокументов.Найти(ЭлементКоллекции);
			Если РезультатПоиска = НеОпределено Тогда
				НоваяСтрока = ТаблицаСвязанныхДокументов.Добавить();
				НоваяСтрока.Ссылка = ЭлементКоллекции.Ссылка;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ТаблицаСвязанныхДокументов Цикл
		Если ТипЗнч(СтрокаТаблицы.Ссылка) = Тип("ДокументСсылка.РабочийЛист") Тогда
			МассивРабочихЛистов.Добавить(СтрокаТаблицы.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
		Если МассивРабочихЛистов.Количество() = 0 Тогда
			МассивРабочихЛистов.Добавить(Документ.РабочийЛист);
		КонецЕсли;
	КонецЕсли;       
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияАвтомобилей") Тогда
		Если ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
			Если МассивРабочихЛистов.Количество() = 0 Тогда
				МассивРабочихЛистов.Добавить(Документ.ДокументОснование.РабочийЛист);
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	

	Возврат МассивРабочихЛистов
		
КонецФункции

// Функция получения рабочих листов выкупа по документу отдела продаж  
//                           
// Параметры:
//  Документ - ДокументСсылка - Ссылка на документ в иерархии которого необходимо найти рабочий лист.
//
// Возвращаемое значение:
//  МассивРабочихЛистов - массив документов рабочий лист.  
//  
Функция ПолучитьРабочиеЛистыВыкупаПоДокументу(Документ) Экспорт
	
	МассивРабочихЛистов = Новый Массив;
	
	ТаблицаКонтроляПовтора = Новый Массив;
	
	ОписаниеТиповДокументов = Документы.ТипВсеСсылки();
	ТаблицаКонтроляПовтора.Добавить(Документ);		
	// Найти корень дерева
	ДокументКорень = НайтиПервыйДокументЦепочкиПодчиненности(Документ, ТаблицаКонтроляПовтора, ОписаниеТиповДокументов);		
	
	ТаблицаСвязанныхДокументов = Новый ТаблицаЗначений;
	ТаблицаСвязанныхДокументов.Колонки.Добавить("Ссылка");
	НоваяСтрока = ТаблицаСвязанныхДокументов.Добавить();
	НоваяСтрока.Ссылка = ДокументКорень;
	
	Для Каждого СтрокаТаблицы Из ТаблицаСвязанныхДокументов Цикл
		МассивСвязанныхДокументов = КритерииОтбора.ПодчиненныеДокументы.Найти(СтрокаТаблицы.Ссылка);			
		Для Каждого ЭлементКоллекции Из МассивСвязанныхДокументов Цикл
			РезультатПоиска = ТаблицаСвязанныхДокументов.Найти(ЭлементКоллекции);
			Если РезультатПоиска = НеОпределено Тогда
				НоваяСтрока = ТаблицаСвязанныхДокументов.Добавить();
				НоваяСтрока.Ссылка = ЭлементКоллекции.Ссылка;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	Для Каждого СтрокаТаблицы Из ТаблицаСвязанныхДокументов Цикл
		Если ТипЗнч(СтрокаТаблицы.Ссылка) = Тип("ДокументСсылка.аа_РабочийЛистТрейдИн") Тогда
			МассивРабочихЛистов.Добавить(СтрокаТаблицы.Ссылка);
		КонецЕсли;
	КонецЦикла;

	Возврат МассивРабочихЛистов
		
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции сбора данных по отделу сервиса

// Функция формирования структуры реквизитов заказ наряда для передачи в CRM  
//                           
// Параметры:
//  ДокЗаказНаряд        - ДокументСсылка.ЗаказНаряд - Ссылка на документ заказ наряд.
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключения - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  СтруктураОбъекта - Структура реквизитов заказ наряда.
// 
Функция ПолучитьОписаниеЗаказНарядаCRM(ДокЗаказНаряд,НастройкаПодключения) Экспорт
	
	Попытка
		
		ДанныеДляПередачи = Новый Структура();
		ДанныеДляПередачиBody = Новый Структура();
		
		ДанныеДляПередачиBody.Вставить("DataType", ДокЗаказНаряд.Метаданные().Синоним);
		GUID = ДокЗаказНаряд.УникальныйИдентификатор(); 
		ДанныеДляПередачиBody.Вставить("Id",GUID);				
		ДанныеДляПередачиBody.Вставить("Number",Формат(ДокЗаказНаряд.Дата,"ДФ=yy-") + ДокЗаказНаряд.Номер);	
		ДанныеДляПередачиBody.Вставить("Date", Формат(ДокЗаказНаряд.Дата,"ДФ=dd.MM.yyyy"));
		Если ТипЗнч(ДокЗаказНаряд) = Тип("ДокументСсылка.ЗаявкаНаРемонт") Тогда
			ДанныеДляПередачиBody.Вставить("DateRepair", Формат(ДокЗаказНаряд.ДатаНачала, "ДЛФ=DT"));
		КонецЕсли;
		Если ЗначениеЗаполнено(ДокЗаказНаряд.ПричинаОбращения) Тогда
			ДанныеДляПередачиBody.Вставить("ClientStatement", ДокЗаказНаряд.ПричинаОбращения);
		КонецЕсли;
		
		Если ТипЗнч(ДокЗаказНаряд) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
			
			Если ЗначениеЗаполнено(ДокЗаказНаряд.ДатаНачала) Тогда
				ДанныеДляПередачиBody.Вставить("DateOpen", Формат(ДокЗаказНаряд.ДатаНачала,"ДФ='dd.MM.yyyy HH:mm'"));
			Иначе
				ДанныеДляПередачиBody.Вставить("DateOpen", Формат(ДокЗаказНаряд.Дата,"ДФ='dd.MM.yyyy HH:mm'"));
			КонецЕсли;
			Если ЗначениеЗаполнено(ДокЗаказНаряд.ДатаЗакрытия) Тогда
				ДанныеДляПередачиBody.Вставить("DateClose", Формат(ДокЗаказНаряд.ДатаЗакрытия,"ДФ='dd.MM.yyyy HH:mm'"));
			КонецЕсли;
			
			Рекомендации = "";
			Если ЗначениеЗаполнено(ДокЗаказНаряд.Рекомендации) И Не ЗначениеЗаполнено(ДокЗаказНаряд.аа_Рекомендации) Тогда      
				Рекомендации = ДокЗаказНаряд.Рекомендации;
			ИначеЕсли ЗначениеЗаполнено(ДокЗаказНаряд.Рекомендации) И ЗначениеЗаполнено(ДокЗаказНаряд.аа_Рекомендации) Тогда      
				Рекомендации = ДокЗаказНаряд.Рекомендации + Символы.ПС + "Рекомендации долговременные: " + ДокЗаказНаряд.аа_Рекомендации;
			ИначеЕсли Не ЗначениеЗаполнено(ДокЗаказНаряд.Рекомендации) И ЗначениеЗаполнено(ДокЗаказНаряд.аа_Рекомендации) Тогда
				Рекомендации = "Рекомендации долговременные: " + ДокЗаказНаряд.аа_Рекомендации;				
			КонецЕсли;   
			Если ЗначениеЗаполнено(Рекомендации) Тогда
				ДанныеДляПередачиBody.Вставить("Recommendations", ДокЗаказНаряд.Рекомендации);
			КонецЕсли;
			
			Если ТипЗнч(ДокЗаказНаряд.ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаРемонт") Тогда
				ДанныеДляПередачиPrimaryServiceCase = Новый Структура("Id_Crm, Id, Date",ДокЗаказНаряд.ДокументОснование.Инфотек_ИдентификаторОбращения, Формат(ДокЗаказНаряд.ДокументОснование.Дата,"ДФ=yy-") + ДокЗаказНаряд.ДокументОснование.Номер, Формат(ДокЗаказНаряд.ДокументОснование.Дата,"ДФ=dd.MM.yyyy"));
				ДанныеДляПередачиBody.Вставить("PrimaryServiceCase",ДанныеДляПередачиPrimaryServiceCase);
			Иначе
				ДанныеДляПередачиPrimaryServiceCase = Новый Структура("Id_Crm, Id, Date","", "", "");
				ДанныеДляПередачиBody.Вставить("PrimaryServiceCase",ДанныеДляПередачиPrimaryServiceCase);
			КонецЕсли;
		КонецЕсли;
		//
		
		ДанныеДляПередачиDepartment = Новый Структура("DataType,Id,Name",ДокЗаказНаряд.Цех.Метаданные().Синоним,ДокЗаказНаряд.Цех.Код,ДокЗаказНаряд.Цех.Наименование);
		
		Если ДанныеДляПередачиDepartment.Количество() > 0 Тогда
			ДанныеДляПередачиBody.Вставить("Department",ДанныеДляПередачиDepartment);
		КонецЕсли;
		
		//Список Пользователь
		ДанныеДляПередачиUser = Новый ТаблицаЗначений();
		ДанныеДляПередачиUser.Колонки.Добавить("DataType");
		ДанныеДляПередачиUser.Колонки.Добавить("Id");
		ДанныеДляПередачиUser.Колонки.Добавить("Name");
		ДанныеДляПередачиUser.Колонки.Добавить("Role");
		ДанныеДляПередачиUser.Колонки.Добавить("Email");
		
		НоваяСтрокаДанныеДляПередачиUser = ДанныеДляПередачиUser.Добавить();
		НоваяСтрокаДанныеДляПередачиUser.DataType = "Сотрудники";
		НоваяСтрокаДанныеДляПередачиUser.Id       = СокрЛП(ДокЗаказНаряд.Автор.Код);
		НоваяСтрокаДанныеДляПередачиUser.Name     = СокрЛП(ДокЗаказНаряд.Автор.Наименование);
		НоваяСтрокаДанныеДляПередачиUser.Role     = "Ответственный";
		
		Email = ПолучитьКИ(ДокЗаказНаряд.Автор,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		стрEmail = "";
		Если Email.Количество() > 0 Тогда
			Если Email.следующий() Тогда
				стрEmail = Email.Представление;
			КонецЕсли;
		КонецЕсли;
		НоваяСтрокаДанныеДляПередачиUser.Email    = стрEmail;
		
		НоваяСтрокаДанныеДляПередачиUser = ДанныеДляПередачиUser.Добавить();
		НоваяСтрокаДанныеДляПередачиUser.DataType = "Сотрудники";
		НоваяСтрокаДанныеДляПередачиUser.Id       = СокрЛП(ДокЗаказНаряд.Мастер.Код);
		НоваяСтрокаДанныеДляПередачиUser.Name     = СокрЛП(ДокЗаказНаряд.Мастер.Наименование);
		НоваяСтрокаДанныеДляПередачиUser.Role     = "Мастер";
		Email = ПолучитьКИ(ДокЗаказНаряд.Мастер,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		стрEmail = "";
		Если Email.Количество() > 0 Тогда
			Если Email.следующий() Тогда
				стрEmail = Email.Представление;
			КонецЕсли;
		КонецЕсли;
		НоваяСтрокаДанныеДляПередачиUser.Email    = стрEmail;	
		
		НоваяСтрокаДанныеДляПередачиUser = ДанныеДляПередачиUser.Добавить();
		НоваяСтрокаДанныеДляПередачиUser.DataType = "Сотрудники";
		НоваяСтрокаДанныеДляПередачиUser.Id       =  СокрЛП(ДокЗаказНаряд.Диспетчер.Код);
		НоваяСтрокаДанныеДляПередачиUser.Name     =  СокрЛП(ДокЗаказНаряд.Диспетчер.Наименование);
		НоваяСтрокаДанныеДляПередачиUser.Role     =  "Диспетчер";
		Email = ПолучитьКИ(ДокЗаказНаряд.Диспетчер,Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		стрEmail = "";
		Если Email.Количество() > 0 Тогда
			Если Email.следующий() Тогда
				стрEmail = Email.Представление;
			КонецЕсли;
		КонецЕсли;
		НоваяСтрокаДанныеДляПередачиUser.Email    = стрEmail;
		
		Если ДанныеДляПередачиUser.Количество() > 0 Тогда
			ДанныеДляПередачиBody.Вставить("Employees",ДанныеДляПередачиUser);
		КонецЕсли;
		
		ДанныеДляПередачиRepairsType = Новый Структура("DataType,Id,Name",ДокЗаказНаряд.ВидРемонта.Метаданные().Синоним,ДокЗаказНаряд.ВидРемонта.Код,ДокЗаказНаряд.ВидРемонта.Наименование);
		
		Если ДанныеДляПередачиRepairsType.Количество() > 0 Тогда
			ДанныеДляПередачиBody.Вставить("RepairType",ДанныеДляПередачиRepairsType);
		КонецЕсли;
		
		////СписокКлиент
		ДанныеДляПередачиClient = Новый Структура();
		
		ДанныеДляПередачиClient.Вставить("DataType",ДокЗаказНаряд.Заказчик.Метаданные().Синоним);
		ДанныеДляПередачиClient.Вставить("Id",СокрЛП(ДокЗаказНаряд.Заказчик.Код));
		
		Если ДокЗаказНаряд.Заказчик.ФормаСобственности =  Перечисления.ФормыСобственности.ЧастноеЛицо Тогда
			
			МассивИмени = обРазложитьСтрокуВМассивПодстрок(ДокЗаказНаряд.Заказчик.Наименование," ");
			
			Если МассивИмени.Количество() > 1 Тогда
				ДанныеДляПередачиClient.Вставить("LastName",МассивИмени[0]);
				ДанныеДляПередачиClient.Вставить("Name",МассивИмени[1]);
				
				Если МассивИмени.Количество() > 2 Тогда
					ДанныеДляПередачиClient.Вставить("MiddleName",МассивИмени[2]);
				КонецЕсли;
			Иначе
				ДанныеДляПередачиClient.Вставить("Name",СокрЛП(ДокЗаказНаряд.Заказчик.Наименование));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДокЗаказНаряд.Заказчик.Пол) Тогда
				ДанныеДляПередачиClient.Вставить("Gender", ИмяЗначенияПеречисления(ДокЗаказНаряд.Заказчик.Пол));
			Иначе
				ДанныеДляПередачиClient.Вставить("Gender", "");
			КонецЕсли;
			
		Иначе
			ДанныеДляПередачиClient.Вставить("LastName","");
			ДанныеДляПередачиClient.Вставить("Name",ДокЗаказНаряд.Заказчик.НаименованиеПолное);
			ДанныеДляПередачиClient.Вставить("MiddleName","");
		КонецЕсли;
		
		Если ДокЗаказНаряд.Заказчик.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да Тогда
			ДанныеДляПередачиClient.Вставить("consentProcessingPersonalInformation","1");
		Иначе
			ДанныеДляПередачиClient.Вставить("consentProcessingPersonalInformation","0");
		КонецЕсли;
		
		Если ДокЗаказНаряд.Заказчик.СогласиеНаПолучениеSMS = Истина Тогда
			ДанныеДляПередачиClient.Вставить("consentObtainingSmsMailing","1");
		Иначе
			ДанныеДляПередачиClient.Вставить("consentObtainingSmsMailing","0");
		КонецЕсли;
		
		
		ДанныеДляПередачиClient.Вставить("Type",ИмяЗначенияПеречисления(ДокЗаказНаряд.Заказчик.ФормаСобственности));
		
		ДанныеДляПередачиClient.Вставить("Kpp",ДокЗаказНаряд.Заказчик.КПП);
		ДанныеДляПередачиClient.Вставить("Inn",ДокЗаказНаряд.Заказчик.ИНН);	
		ДанныеДляПередачиClient.Вставить("Addresses", );
		ДанныеДляПередачиClient.Вставить("Contacts", );
		
		
		////Контактная информация - структура
		Email = ПолучитьКИ(ДокЗаказНаряд.Заказчик, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		стрEmail = "";
		Если Email.Количество()>0 Тогда
			Если Email.следующий() Тогда
				стрEmail = Email.Представление;
			КонецЕсли;
		КонецЕсли;
		ДанныеДляПередачиClient.Вставить("Email",стрEmail);
		
		ДанныеДляПередачиAddr = Новый ТаблицаЗначений();
		
		ДанныеДляПередачиAddr.Колонки.Добавить("Addr");
		ДанныеДляПередачиAddr.Колонки.Добавить("DataType");
		ДанныеДляПередачиAddr.Колонки.Добавить("Type");
		ДанныеДляПередачиAddr.Колонки.Добавить("PostCode");
		ДанныеДляПередачиAddr.Колонки.Добавить("Region");
		ДанныеДляПередачиAddr.Колонки.Добавить("District");
		ДанныеДляПередачиAddr.Колонки.Добавить("City");
		ДанныеДляПередачиAddr.Колонки.Добавить("Street");
		ДанныеДляПередачиAddr.Колонки.Добавить("House");
		ДанныеДляПередачиAddr.Колонки.Добавить("Building");
		ДанныеДляПередачиAddr.Колонки.Добавить("Apartment");
		
		Адреса = ПолучитьКИ(ДокЗаказНаряд.Заказчик, Перечисления.ТипыКонтактнойИнформации.Адрес);
		Если Адреса.Количество()>0 Тогда
			Пока Адреса.следующий() Цикл
				НоваяСтрокаДанныеДляПередачиAddr = ДанныеДляПередачиAddr.Добавить();
				НоваяСтрокаДанныеДляПередачиAddr.DataType = "Адреса";
				НоваяСтрокаДанныеДляПередачиAddr.Type     = Адреса.Вид.Наименование;
				НоваяСтрокаДанныеДляПередачиAddr.Addr     = Адреса.Представление;
				НоваяСтрокаДанныеДляПередачиAddr.PostCode = Адреса.Поле1;
				НоваяСтрокаДанныеДляПередачиAddr.Region   = Адреса.Поле2;
				НоваяСтрокаДанныеДляПередачиAddr.District = Адреса.Поле3;
				НоваяСтрокаДанныеДляПередачиAddr.City     = Адреса.Поле4;
				НоваяСтрокаДанныеДляПередачиAddr.Street   = Адреса.Поле6;
				НоваяСтрокаДанныеДляПередачиAddr.House    = Адреса.Поле7;
				НоваяСтрокаДанныеДляПередачиAddr.Building = Адреса.Поле8;
				НоваяСтрокаДанныеДляПередачиAddr.Apartment = Адреса.Поле9;
			КонецЦикла;
		Иначе
			НоваяСтрокаДанныеДляПередачиAddr = ДанныеДляПередачиAddr.Добавить();
			НоваяСтрокаДанныеДляПередачиAddr.DataType = "Адреса";
			НоваяСтрокаДанныеДляПередачиAddr.Type     = "";
			НоваяСтрокаДанныеДляПередачиAddr.Addr     = "";
			НоваяСтрокаДанныеДляПередачиAddr.PostCode = "";
			НоваяСтрокаДанныеДляПередачиAddr.Region   = "";
			НоваяСтрокаДанныеДляПередачиAddr.District = "";
			НоваяСтрокаДанныеДляПередачиAddr.City     = "";
			НоваяСтрокаДанныеДляПередачиAddr.Street   = "";
			НоваяСтрокаДанныеДляПередачиAddr.House    = "";
			НоваяСтрокаДанныеДляПередачиAddr.Building = "";
			НоваяСтрокаДанныеДляПередачиAddr.Apartment = "";
		КонецЕсли;
		
		ДанныеДляПередачиClient.Вставить("Addresses", ДанныеДляПередачиAddr);
		
		
		Телефоны = ПолучитьКИ(ДокЗаказНаряд.Заказчик, Перечисления.ТипыКонтактнойИнформации.Телефон);
		////
		ТелефоныКлиента = Новый ТаблицаЗначений();
		ТелефоныКлиента.Колонки.Добавить("DataType");
		ТелефоныКлиента.Колонки.Добавить("Type");
		ТелефоныКлиента.Колонки.Добавить("Number");
		Пока Телефоны.следующий() цикл
			НоваяСтрокаНомер =  ТелефоныКлиента.Добавить();
			НоваяСтрокаНомер.DataType = "Телефоны";
			Если ЗначениеЗаполнено(Телефоны.Вид) Тогда
				НоваяСтрокаНомер.Type     = Телефоны.Вид.Наименование;
			КонецЕсли;
			НоваяСтрокаНомер.Number   = Телефоны.Представление;
		КонецЦикла;
		
		ДанныеДляПередачиClient.Вставить("Phones", ТелефоныКлиента);
		//		
		ДанныеДляПередачиDocuments = Новый ТаблицаЗначений();
		ДанныеДляПередачиDocuments.Колонки.Добавить("DataType");
		ДанныеДляПередачиDocuments.Колонки.Добавить("Type");
		ДанныеДляПередачиDocuments.Колонки.Добавить("Serie");
		ДанныеДляПередачиDocuments.Колонки.Добавить("Number");
		ДанныеДляПередачиDocuments.Колонки.Добавить("IssuedAt");
		ДанныеДляПередачиDocuments.Колонки.Добавить("IssuedBy");
		
		////Паспортные данные
		ПаспортныеДанные = ПолучитьПаспортныеДанные(ДокЗаказНаряд.Заказчик);
		ТипДокумента = "";
		ПаспСерия    = "";
		ПаспНомер    = "";
		ПаспортВыдан = "";
		ПаспортДатаВыдачи = "";
		
		Если ПаспортныеДанные.Количество()> 0 Тогда
			Если ПаспортныеДанные.Следующий() Тогда
				ТипДокумента = ИмяЗначенияПеречисления(ПаспортныеДанные.ВидПодтверждающегоДокумента);
				ПаспСерия    = ПаспортныеДанные.Серия;
				ПаспНомер    = ПаспортныеДанные.Номер;
				ПаспортВыдан = ПаспортныеДанные.КемВыдан;
				ПаспортДатаВыдачи = ПаспортныеДанные.ДатаВыдачи;			
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрокаДанныеДляПередачиDocuments = ДанныеДляПередачиDocuments.Добавить();
		НоваяСтрокаДанныеДляПередачиDocuments.DataType = "Подтверждающие документы";
		НоваяСтрокаДанныеДляПередачиDocuments.Type = ТипДокумента;
		НоваяСтрокаДанныеДляПередачиDocuments.Serie = ПаспСерия;
		НоваяСтрокаДанныеДляПередачиDocuments.Number = ПаспНомер;
		НоваяСтрокаДанныеДляПередачиDocuments.IssuedAt = ПаспортДатаВыдачи;
		НоваяСтрокаДанныеДляПередачиDocuments.IssuedBy = ПаспортВыдан;
		
		ДанныеДляПередачиClient.Вставить("Documents",ДанныеДляПередачиDocuments);
		//
		//Контактные лица - структура
		//
		ДанныеДляПередачиContacts = Новый ТаблицаЗначений();
		ДанныеДляПередачиContacts.Колонки.Добавить("DataType");
		ДанныеДляПередачиContacts.Колонки.Добавить("Id");
		ДанныеДляПередачиContacts.Колонки.Добавить("Name");
		ДанныеДляПередачиContacts.Колонки.Добавить("Phones");
		ИнфоПоКЛ = ПолучитьКЛ(ДокЗаказНаряд.Заказчик);
		Если ИнфоПоКЛ.Количество() > 0 Тогда
			Пока ИнфоПоКЛ.Следующий() Цикл
				СтрокаДанныеДляПередачиContacts = ДанныеДляПередачиContacts.Добавить();
				СтрокаДанныеДляПередачиContacts.DataType      = "Контактные лица";
				СтрокаДанныеДляПередачиContacts.Id    = ИнфоПоКЛ.КонтактноеЛицо.Код;
				СтрокаДанныеДляПередачиContacts.Name  = ИнфоПоКЛ.КонтактноеЛицо.Наименование;
				ТелефоныКЛ = ПолучитьКИ(ИнфоПоКЛ.КонтактноеЛицо, Перечисления.ТипыКонтактнойИнформации.Телефон);
				ТабТелефоныКЛ = Новый ТаблицаЗначений();
				ТабТелефоныКЛ.Колонки.Добавить("DataType");
				ТабТелефоныКЛ.Колонки.Добавить("Type");
				ТабТелефоныКЛ.Колонки.Добавить("Number");
				Если ТелефоныКЛ <> Неопределено Тогда
					Пока ТелефоныКЛ.следующий() цикл
						НоваяСтрокаНомер =  ТабТелефоныКЛ.Добавить();
						НоваяСтрокаНомер.DataType = "Телефоны";
						Если ЗначениеЗаполнено(ТелефоныКЛ.Вид) Тогда
							НоваяСтрокаНомер.Type     = ТелефоныКЛ.Вид.Наименование;
						КонецЕсли;
						НоваяСтрокаНомер.Number   = ТелефоныКЛ.Представление;
					КонецЦикла;
					СтрокаДанныеДляПередачиContacts.Phones = ТабТелефоныКЛ;		
				КонецЕсли;
				СтрокаДанныеДляПередачиContacts.Phones = ТабТелефоныКЛ;		
				
				PackagePrimaryContact = Новый Структура();
				PackagePrimaryContact.Вставить("DataType","Контактное лицо");
				PackagePrimaryContact.Вставить("Id",ИнфоПоКЛ.КонтактноеЛицо.Код);
				МассивИмени = обРазложитьСтрокуВМассивПодстрок(ИнфоПоКЛ.КонтактноеЛицо.Наименование," ");			
				Если МассивИмени.Количество()>1 Тогда
					PackagePrimaryContact.Вставить("LastName",МассивИмени[0]);
					PackagePrimaryContact.Вставить("Name",МассивИмени[1]);
					Если МассивИмени.Количество()>2 Тогда
						PackagePrimaryContact.Вставить("MiddleName",МассивИмени[2]);
					КонецЕсли;
				Иначе
					PackagePrimaryContact.Вставить("Name",СокрЛП(ИнфоПоКЛ.КонтактноеЛицо.Наименование));
				КонецЕсли;
				Если  ИнфоПоКЛ.КонтактноеЛицо.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да Тогда
					PackagePrimaryContact.Вставить("consentObtainingSmsMailing","1");
					PackagePrimaryContact.Вставить("consentProcessingPersonalInformation","1");
				Иначе
					PackagePrimaryContact.Вставить("consentProcessingPersonalInformation","0");
					PackagePrimaryContact.Вставить("consentObtainingSmsMailing","0");
				КонецЕсли;
				Если ТабТелефоныКЛ.Количество() > 0 Тогда
					PackagePrimaryContact.Вставить("Phones",ТабТелефоныКЛ);
				КонецЕсли;
				ДанныеДляПередачиClient.Вставить("PrimaryContact", PackagePrimaryContact);				
			КонецЦикла;
		КонецЕсли;
			
		ДанныеДляПередачиClient.Вставить("Contacts", ДанныеДляПередачиContacts);
		
		////
		Если ДанныеДляПередачиClient.Количество()>0 Тогда
			ДанныеДляПередачиBody.Вставить("Client",ДанныеДляПередачиClient);
		КонецЕсли;
		
		////Список Авто
		//ДанныеДляПередачиCar = Новый ТаблицаЗначений();
		ДанныеДляПередачиCar = Новый Структура();
		
		ДанныеДляПередачиCar.Вставить("DataType", ДокЗаказНаряд.Автомобиль.Метаданные().Синоним);
		ДанныеДляПередачиCar.Вставить("Id", ДокЗаказНаряд.Автомобиль.Код);
		ДанныеДляПередачиCar.Вставить("VIN",  ДокЗаказНаряд.Автомобиль.VIN);
		
		ДанныеДляПередачиModel = Новый Структура("DataType,Id,Name",ДокЗаказНаряд.Автомобиль.Модель.Метаданные().Синоним,ДокЗаказНаряд.Автомобиль.Модель.Код,ДокЗаказНаряд.Автомобиль.Модель.Наименование);
		
		ДанныеДляПередачиCar.Вставить("Model", ДанныеДляПередачиModel);
		
		стрГосНомер = "";
		ГосНомер = ПолучитьИнфоПоАвто(ДокЗаказНаряд.Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		Если ГосНомер.Следующий() Тогда
			стрГосНомер = ГосНомер.Значение;
		КонецЕсли;
		ДанныеДляПередачиCar.Вставить("RegNum", стрГосНомер);
		
		стрПробег = "";	
		Если ЗначениеЗаполнено(ДокЗаказНаряд.Пробег) Тогда
			стрПробег = ДокЗаказНаряд.Пробег;
		Иначе
			Пробег = ПолучитьИнфоПоАвто(ДокЗаказНаряд.Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,ДокЗаказНаряд.Дата);
			Если Пробег.Следующий() Тогда
				стрПробег = Пробег.Значение;
			КонецЕсли;
		КонецЕсли;
		ДанныеДляПередачиCar.Вставить("Mileage", стрПробег);
		////
		Если ЗначениеЗаполнено(ДокЗаказНаряд.Автомобиль.ГодВыпуска) Тогда
			ДанныеДляПередачиCar.Вставить("ProductionYear", Год(ДокЗаказНаряд.Автомобиль.ГодВыпуска));
		иначе
			ДанныеДляПередачиCar.Вставить("ProductionYear", "");
		КонецЕсли;
		ДанныеДляПередачиCar.Вставить("WarrantyStart",Формат(ДокЗаказНаряд.Автомобиль.ДатаНачалаГарантии,"ДФ=dd.MM.yyyy"));
		ДанныеДляПередачиCar.Вставить("WarrantyEnd",Формат(ДокЗаказНаряд.Автомобиль.ДатаОкончанияГарантии,"ДФ=dd.MM.yyyy"));
		
		//двигатель
		ДанныеДляПередачиcarEngine = Новый Структура("DataType,Id,Name",ДокЗаказНаряд.Автомобиль.ТипДвигателя.Метаданные().Синоним,ДокЗаказНаряд.Автомобиль.ТипДвигателя.Код,ДокЗаказНаряд.Автомобиль.ТипДвигателя.Наименование);
		ДанныеДляПередачиCar.Вставить("Engine", ДанныеДляПередачиcarEngine);
				
		//КПП
		ДанныеДляПередачиcarTransmission = Новый Структура("DataType,Id,Name",ДокЗаказНаряд.Автомобиль.ТипКПП.Метаданные().Синоним,ДокЗаказНаряд.Автомобиль.ТипКПП.Код,ДокЗаказНаряд.Автомобиль.ТипКПП.Наименование);		
		ДанныеДляПередачиCar.Вставить("Transmission", ДанныеДляПередачиcarTransmission);
		
		//Цвет
		ДанныеДляПередачиcarColor = Новый Структура("DataType,Id,Name",ДокЗаказНаряд.Автомобиль.Цвет.Метаданные().Синоним,ДокЗаказНаряд.Автомобиль.Цвет.Код,ДокЗаказНаряд.Автомобиль.Цвет.Наименование);
		ДанныеДляПередачиCar.Вставить("Color",  ДанныеДляПередачиcarColor);
		
		Если ДанныеДляПередачиCar.Количество()>0 Тогда
			ДанныеДляПередачиBody.Вставить("Car",ДанныеДляПередачиCar);
		КонецЕсли;
		
		//Работы
		ДанныеДляПередачиWorkType = Новый ТаблицаЗначений();
		ДанныеДляПередачиWorkType.Колонки.Добавить("DataType");
		ДанныеДляПередачиWorkType.Колонки.Добавить("Id");
		ДанныеДляПередачиWorkType.Колонки.Добавить("Type");
		ДанныеДляПередачиWorkType.Колонки.Добавить("StandardTime");
		ДанныеДляПередачиWorkType.Колонки.Добавить("Price");
		ДанныеДляПередачиWorkType.Колонки.Добавить("Quantity");
		
		ДанныеДляПередачиWorkType.Колонки.Добавить("DiscountPercent");
		ДанныеДляПередачиWorkType.Колонки.Добавить("Sum");
		
		
		Для Каждого СтрРаботы из ДокЗаказНаряд.Работы цикл
			НоваяСтрокаДанныеДляПередачиWorkType = ДанныеДляПередачиWorkType.Добавить();
			НоваяСтрокаДанныеДляПередачиWorkType.DataType = "Работы заказ-наряда";
			НоваяСтрокаДанныеДляПередачиWorkType.Id       = СтрРаботы.НомерСтроки;
			
			СтруктураWorkType = Новый Структура();
			СтруктураWorkType.Вставить("DataType",СтрРаботы.Работа.Метаданные().Синоним);
			СтруктураWorkType.Вставить("Id",СтрРаботы.Работа.Код);
			СтруктураWorkType.Вставить("Name",СтрРаботы.Работа.Наименование);
			Для Каждого СтрокаНормыВремени ИЗ СтрРаботы.Работа.НормыВремени Цикл
				Если ЗначениеЗаполнено(СтрокаНормыВремени.ВремяВыполнения) Тогда
					СтруктураWorkType.Вставить("StandardTime",Формат(СтрокаНормыВремени.ВремяВыполнения,"ЧЦ=10; ЧДЦ=2"));
				КонецЕсли;
			КонецЦикла;
			СтруктураWorkType.Вставить("Code",СтрРаботы.Работа.Артикул);
			
			НоваяСтрокаДанныеДляПередачиWorkType.Type            = СтруктураWorkType;
			НоваяСтрокаДанныеДляПередачиWorkType.Quantity        = Формат(СтрРаботы.Количество,"ЧЦ=10; ЧДЦ=2");
			НоваяСтрокаДанныеДляПередачиWorkType.DiscountPercent = Формат(СтрРаботы.ПроцентСкидки,"ЧЦ=10; ЧДЦ=2");
			НоваяСтрокаДанныеДляПередачиWorkType.Sum             = Формат(СтрРаботы.СуммаВсего,"ЧЦ=10; ЧДЦ=2");
			НоваяСтрокаДанныеДляПередачиWorkType.StandardTime    = Формат(СтрРаботы.Коэффициент,"ЧЦ=10; ЧДЦ=2");
			НоваяСтрокаДанныеДляПередачиWorkType.Price           = Формат(СтрРаботы.Цена,"ЧЦ=10; ЧДЦ=2");
		КонецЦикла;
		
		Если ДанныеДляПередачиWorkType.Количество()>0 Тогда
			ДанныеДляПередачиBody.Вставить("Works",ДанныеДляПередачиWorkType);
		КонецЕсли;
		
		ДанныеДляПередачиMaterials = Новый ТаблицаЗначений();
		ДанныеДляПередачиMaterials.Колонки.Добавить("DataType");
		ДанныеДляПередачиMaterials.Колонки.Добавить("Id");
		ДанныеДляПередачиMaterials.Колонки.Добавить("Type");
		ДанныеДляПередачиMaterials.Колонки.Добавить("Price");
		ДанныеДляПередачиMaterials.Колонки.Добавить("Quantity");
		ДанныеДляПередачиMaterials.Колонки.Добавить("DiscountPercent");
		ДанныеДляПередачиMaterials.Колонки.Добавить("Sum");
		Если ДокЗаказНаряд.Товары.Количество()>0 Тогда
			Для Каждого СтрЗапЧасти из ДокЗаказНаряд.Товары цикл
				НоваяСтрокаДанныеДляПередачиMaterials = ДанныеДляПередачиMaterials.Добавить();
				НоваяСтрокаДанныеДляПередачиMaterials.DataType = "Материалы заказ-наряда";
				НоваяСтрокаДанныеДляПередачиMaterials.Id       = СтрЗапЧасти.НомерСтроки;
				
				СтруктураMaterialsType = Новый Структура();
				СтруктураMaterialsType.Вставить("DataType",СтрЗапЧасти.Номенклатура.Метаданные().Синоним);
				СтруктураMaterialsType.Вставить("Id",СтрЗапЧасти.Номенклатура.Код);
				СтруктураMaterialsType.Вставить("Name",СтрЗапЧасти.Номенклатура.Наименование);
				СтруктураMaterialsType.Вставить("Code",СтрЗапЧасти.Номенклатура.Артикул);
				
				//
				НоваяСтрокаДанныеДляПередачиMaterials.Type     = СтруктураMaterialsType;
				НоваяСтрокаДанныеДляПередачиMaterials.Quantity = Формат(СтрЗапЧасти.Количество,"ЧЦ=10; ЧДЦ=2");
				НоваяСтрокаДанныеДляПередачиMaterials.DiscountPercent =  Формат(СтрЗапЧасти.ПроцентСкидки,"ЧЦ=10; ЧДЦ=2");
				НоваяСтрокаДанныеДляПередачиMaterials.Sum      = Формат(СтрЗапЧасти.СуммаВсего,"ЧЦ=10; ЧДЦ=2");
				НоваяСтрокаДанныеДляПередачиMaterials.Price    = Формат(СтрЗапЧасти.Цена,"ЧЦ=10; ЧДЦ=2");
			КонецЦикла;
		иначе
		КонецЕсли;
		
		Если ДанныеДляПередачиMaterials.Количество()>0 Тогда
			ДанныеДляПередачиBody.Вставить("Materials",ДанныеДляПередачиMaterials);
		КонецЕсли;
		
		////Этапы
		Если ТипЗнч(ДокЗаказНаряд) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
			НаименованиеСостояния = "";
			Если ДокЗаказНаряд.ПометкаУдаления = Истина Тогда
				НаименованиеСостояния = "Удалено";
			ИначеЕсли ДокЗаказНаряд.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Заявка Тогда
				НаименованиеСостояния = "Заявка";
			ИначеЕсли ДокЗаказНаряд.Состояние = Справочники.ВидыСостоянийЗаказНарядов.ВРаботе  Тогда
				НаименованиеСостояния = "В работе";
			ИначеЕсли ДокЗаказНаряд.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Выполнен Тогда
				НаименованиеСостояния = "Выполнено";
			ИначеЕсли ДокЗаказНаряд.Состояние = Справочники.ВидыСостоянийЗаказНарядов.Закрыт Тогда
				НаименованиеСостояния = "Закрыт";
			Иначе
				НаименованиеСостояния = "В работе";
			КонецЕсли;
			ДанныеДляПередачиStage = Новый Структура("DataType,Id,Name",ДокЗаказНаряд.Состояние.Метаданные().Синоним,ДокЗаказНаряд.Состояние.Код,НаименованиеСостояния);
		Иначе
			ДанныеДляПередачиStage = Новый Структура("DataType,Id,Name","Состояния заказ-нарядов","Заявка на ремонт","Заявка на ремонт");
		КонецЕсли;
		
		
		Если ДанныеДляПередачиStage.Количество()>0 Тогда
			ДанныеДляПередачиBody.Вставить("Stage",ДанныеДляПередачиStage);
		КонецЕсли;
		
		Возврат ДанныеДляПередачиBody;
		
	Исключение
		Сообщить("CRM_Заказ-наряд ошибка при обработке данных!!!");
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции	

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции сбора данных по складу автомобилей

// Функция формирования структуры реквизитов места хранения на складе для передачи в CRM  
//                           
// Параметры:
//  СтруктураСклада      - Структура - Структура места хранения в CRM
//  Документ             - ДокументСсылка - Ссылка на документ поступление/перемещение автомобилей.
//  ID_Автомобиля        - Строка - Идентификатор автомобиля на складе в CRM
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключения - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  СтруктураОбъекта - Структура реквизитов места хранения автомобиля.
// 
Функция ПолучитьОписаниеМестаХраненияСклада(СтруктураСклада,Документ,ID_Автомобиля,НастройкаПодключения) Экспорт
	
	СтруктураОбъекта = Новый Структура;
	
	СтруктураОбъекта.Вставить("Идентификатор",ID_Автомобиля);
	СтруктураОбъекта.Вставить("ИдентификаторСклада",СтруктураСклада.id);
	СтруктураОбъекта.Вставить("Дата",Формат(Документ.Дата,"ДФ=dd.MM.yyyy"));	
	
	Возврат СтруктураОбъекта;
	
КонецФункции

// Функция формирования структуры реквизитов статуса на складе для передачи в CRM  
//                           
// Параметры:
//  Документ             - ДокументСсылка - Ссылка на документ поступление/перемещение автомобилей.
//  ID_Автомобиля        - Строка - Идентификатор автомобиля на складе в CRM
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключения - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  СтруктураОбъекта - Структура реквизитов статуса автомобиля на складе.
// 
Функция ПолучитьОписаниеСтатусаАвтомобиляНаСкладе(Документ,ID_Автомобиля,НастройкаПодключения) Экспорт
	
	СтруктураОбъекта = Новый Структура;
	
	СтруктураОбъекта.Вставить("Идентификатор",ID_Автомобиля);
	Если Документ.ПометкаУдаления = Истина Тогда
		СтруктураОбъекта.Вставить("Статус",6);    
	Иначе
		СтруктураОбъекта.Вставить("Статус",1);    
	КонецЕсли;	
	СтруктураОбъекта.Вставить("Дата",Формат(Документ.Дата,"ДФ=dd.MM.yyyy"));	
	
	Возврат СтруктураОбъекта;
	
КонецФункции

// Функция формирования структуры реквизитов дополнительного оборудования автомобиля на складе для передачи в CRM  
//                           
// Параметры:
//  ДокЗаказНаряд        - ДокументСсылка.ЗаказНаряд - Ссылка на документ заказ наряд.
//  ID_Автомобиля        - Строка - Идентификатор автомобиля на складе в CRM
//  НастройкаПодключения - СправочникСсылка.Инфотек_НастройкиПодключения - Ссылка на настройку подключения для получения параметров авторизации.
//
// Возвращаемое значение:
//  СтруктураОбъекта - Структура реквизитов дополнительного оборудования автомобиля.
// 
Функция ПолучитьОписаниеДополнительногоОборудованияАвтомобиля(ДокЗаказНаряд,ID_Автомобиля,НастройкаПодключения) Экспорт
	
	СтруктураОбъекта = Новый Структура;
	
	СтруктураОбъекта.Вставить("ЗаказНаряд",ДокЗаказНаряд);
	СтруктураОбъекта.Вставить("Автомобиль",ДокЗаказНаряд.Автомобиль);
	СтруктураОбъекта.Вставить("Идентификатор",ID_Автомобиля);
	СтрокаДополнительныхРабот = "";
	Для Каждого СтрокаРабот ИЗ ДокЗаказНаряд.Работы Цикл
		СтрокаДополнительныхРабот = СтрокаДополнительныхРабот + СтрокаРабот.Работа.Наименование + "; "
	КонецЦикла;
	Если ЗначениеЗаполнено(СтрокаДополнительныхРабот) Тогда
		СтрокаДополнительныхРабот = "Автоработы: " + СтрокаДополнительныхРабот;
	КонецЕсли;
	СтрокаДополнительногоОборудования = "";
	Для Каждого СтрокаТовара ИЗ ДокЗаказНаряд.Товары Цикл
		СтрокаДополнительногоОборудования = СтрокаДополнительногоОборудования + СтрокаТовара.Номенклатура.Наименование + "; "
	КонецЦикла;
	Если ЗначениеЗаполнено(СтрокаДополнительногоОборудования) Тогда
		СтрокаДополнительногоОборудования = "Запчасти: " + СтрокаДополнительногоОборудования;
	КонецЕсли;
    СтрокаДопов = "Заказ наряд № " + ДокЗаказНаряд.Номер + "; " + СтрокаДополнительныхРабот + СтрокаДополнительногоОборудования;  
	СтруктураОбъекта.Вставить("СтрокаДополнительногоОборудования",СтрокаДопов);
	СтруктураОбъекта.Вставить("СуммаДополнительногоОборудования",ДокЗаказНаряд.СуммаДокумента);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Продажи.Себестоимость, 0) КАК Себестоимость
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Регистратор = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор", ДокЗаказНаряд);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Себестоимость = 0;
		Количество = 0;
		Пока Выборка.Следующий() Цикл
			Себестоимость = Себестоимость + Выборка.Себестоимость;
		КонецЦикла;
		СтруктураОбъекта.Вставить("СебестоимостьДополнительногоОборудования",Себестоимость);
	КонецЕсли;
	
	Возврат СтруктураОбъекта;
	
КонецФункции
